In [4]:
import pandas as pd
import numpy as np

In [5]:
import os
print(os.getcwd())  # 현재 작업 디렉터리 확

c:\SKN_19\python_basic\13_pandas

In [48]:
file_path = "./data/S_P500_Prices.csv"
sp500_df = pd.read_csv(file_path) 
sp500_df.info()
sp500_df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2159 entries, 0 to 2158
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sp500   2159 non-null   float64
dtypes: float64(1)
memory usage: 17.0 KB

             sp500
count  2159.000000
mean   2218.749554
std     537.321727
min    1278.040039
25%    1847.984985
50%    2106.629883
75%    2705.810059
max    3386.149902

In [7]:
sp500_df.head()
sp500_df.shape

(2159, 1)

In [8]:
sp500_df.squeeze()
sp500_df.shape

(2159, 1)

In [9]:
sp500_df[100:200]

           sp500
100  1315.130005
101  1314.989990
102  1325.660034
103  1308.930054
104  1324.180054
..           ...
195  1433.189941
196  1433.819946
197  1413.109985
198  1408.750000
199  1412.969971

[100 rows x 1 columns]

In [10]:
sp500_df.iloc[100:200]

           sp500
100  1315.130005
101  1314.989990
102  1325.660034
103  1308.930054
104  1324.180054
..           ...
195  1433.189941
196  1433.819946
197  1413.109985
198  1408.750000
199  1412.969971

[100 rows x 1 columns]

In [11]:
# fancy indexing (1000, 2000만 꺼내기)
sp500_ser = sp500_df["sp500"]

sp500_ser[sp500_ser > 1000]

0       1295.500000
1       1289.089966
2       1293.670044
3       1308.040039
4       1314.500000
           ...
2154    3327.770020
2155    3349.159912
2156    3351.280029
2157    3360.469971
2158    3333.689941
Name: sp500, Length: 2159, dtype: float64

In [12]:
print(3013.770020 in sp500_ser)
print(3013.770020 in sp500_ser.values)
print(1348259874247565643654367866652 in sp500_ser)
print(1348259874247565643654367866652 in sp500_ser.index)

False
True
False
False

In [13]:
print(sp500_ser.sort_values(ascending=False))

2037    3386.149902
2035    3380.159912
2033    3379.449951
2034    3373.939941
2038    3373.229980
           ...
2       1293.670044
1       1289.089966
99      1285.500000
98      1278.180054
97      1278.040039
Name: sp500, Length: 2159, dtype: float64

---
##### Dataframe 생성

In [14]:
# 2차원 ndarray 활용
arr = np.random.randn(2, 3)
df = pd.DataFrame(arr)

df.index = ['ㄱ', 'ㄴ']
df.columns = ['A', 'B', 'C']


# dictionary-list 활용
data= {
    '숫자': [1,2,3,4,5],
    '한글': ['가', '나', '다', '라', '마'],
    '소수': [1.23, 2.34, 3.45, 4.56, 5.67],
    'boolean': True
}
df = pd.DataFrame(data)
print(df, end='\n')


# list-dictionary 활용
data = [
    {'a': 1, 'b': 2, 'c': 3},
    {'a': 4, 'b': 5, 'c': 6},
    {'a': 7, 'b': 8, 'c': 9}
]
df = pd.DataFrame(data)
print(df)

   숫자 한글    소수  boolean
0   1  가  1.23     True
1   2  나  2.34     True
2   3  다  3.45     True
3   4  라  4.56     True
4   5  마  5.67     True
   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [15]:
data = {
    '이름': ['토끼', '핀다', '코알라'],
    '위치': ['독산', '종로', '하남'],
    '성별': ['F', 'M', 'F']
}
df = pd.DataFrame(data)
df

    이름  위치 성별
0   토끼  독산  F
1   핀다  종로  M
2  코알라  하남  F

In [16]:
# 전치행렬
df.T

     0   1    2
이름  토끼  핀다  코알라
위치  독산  종로   하남
성별   F   M    F

---
##### DataFrame 속성

In [17]:
print(df.index)
print(df.columns)
print(df.values, type(df.values))

RangeIndex(start=0, stop=3, step=1)
Index(['이름', '위치', '성별'], dtype='object')
[['토끼' '독산' 'F']
 ['핀다' '종로' 'M']
 ['코알라' '하남' 'F']] <class 'numpy.ndarray'>

In [18]:
bank_client_df = pd.DataFrame({
    'client_ID': [1, 2, 3, 4],
    'client Name': ['A', 'B', 'C', 'D'],
    'Net worth [$]': [100, 200, 300, 400],
    'year with bank': [1, 2, 3, 4]
})
df = pd.DataFrame(bank_client_df)
df

   client_ID client Name  Net worth [$]  year with bank
0          1           A            100               1
1          2           B            200               2
2          3           C            300               3
3          4           D            400               4

In [19]:
# fancy indexing을 통한 조회결과는 1개여도 dp타입으로 반환
# - Series를 반환한다는 것은 차원을 축소(제거)하는 것
# - Dataframe을 반환한다는 것은 차원을 유지하는 것

In [20]:
data = {
    "Client Name": ["Alice", "Bob", "Steve", "Emma", "John"],
    "net worth": [100000, 250000, 500000, 750000, 300000],
    "Age": [28, 35, 40, 30, 45]
}

bank_client_df = pd.DataFrame(data)

print(bank_client_df)

  Client Name  net worth  Age
0       Alice     100000   28
1         Bob     250000   35
2       Steve     500000   40
3        Emma     750000   30
4        John     300000   45

In [21]:
# 이름이 Steve인 고객 정보 출력
# client name만 출력
# client name과 net worth 출력

print(bank_client_df[bank_client_df["Client Name"] == "Steve"], end='\n\n')
print(bank_client_df["Client Name"], end='\n\n')
print(bank_client_df[["Client Name", "net worth"]])

  Client Name  net worth  Age
2       Steve     500000   40

0    Alice
1      Bob
2    Steve
3     Emma
4     John
Name: Client Name, dtype: object

  Client Name  net worth
0       Alice     100000
1         Bob     250000
2       Steve     500000
3        Emma     750000
4        John     300000

In [22]:
# filter
bank_client_df.filter(items=['Client Name', 'net worth'])

  Client Name  net worth
0       Alice     100000
1         Bob     250000
2       Steve     500000
3        Emma     750000
4        John     300000

In [23]:
bank_client_df.filter(like='worth', axis=1)

   net worth
0     100000
1     250000
2     500000
3     750000
4     300000

In [24]:
bank_client_df.filter(like='3', axis=0)

  Client Name  net worth  Age
3        Emma     750000   30

In [25]:
# length는 last index보다 1 크기 때문에 하나 append한 셈
bank_client_df.loc[len(bank_client_df)] = ['Emma', 750000, 30]
bank_client_df

  Client Name  net worth  Age
0       Alice     100000   28
1         Bob     250000   35
2       Steve     500000   40
3        Emma     750000   30
4        John     300000   45
5        Emma     750000   30

In [26]:
# pd.concat() 이용
bank_client_df = pd.concat([bank_client_df, pd.DataFrame(['Hola', 19000, 40])], ignore_index=True)
bank_client_df = bank_client_df[:12]
bank_client_df

  Client Name  net worth   Age      0
0       Alice   100000.0  28.0    NaN
1         Bob   250000.0  35.0    NaN
2       Steve   500000.0  40.0    NaN
3        Emma   750000.0  30.0    NaN
4        John   300000.0  45.0    NaN
5        Emma   750000.0  30.0    NaN
6         NaN        NaN   NaN   Hola
7         NaN        NaN   NaN  19000
8         NaN        NaN   NaN     40

In [27]:
#행 삭제
# index 사용
# df.drop(df.index[[0]])
bank_client_df.drop(bank_client_df.index[[0]], inplace=True)
bank_client_df

  Client Name  net worth   Age      0
1         Bob   250000.0  35.0    NaN
2       Steve   500000.0  40.0    NaN
3        Emma   750000.0  30.0    NaN
4        John   300000.0  45.0    NaN
5        Emma   750000.0  30.0    NaN
6         NaN        NaN   NaN   Hola
7         NaN        NaN   NaN  19000
8         NaN        NaN   NaN     40

---
##### 컬럼 추가

In [28]:
df = pd.DataFrame({
    '이름': ['토끼', '핀다', '코알라'],
    '위치': ['독산', '종로', '하남'],
    '성별': ['F', 'M', 'F']
})
df

    이름  위치 성별
0   토끼  독산  F
1   핀다  종로  M
2  코알라  하남  F

In [31]:
# 컬럼 추가1 기본값 이용
df['취미'] = '인공지능'
print(df)

# 컬럼 추가2 np.where() -> ndarray 이용
print(np.where(df['성별'] == 'M'))
# 삼항조건임. if 조건식 A else B
print(np.where(df['성별'] == 'M', '남성', '여성'))
# 컬럼추가
df['성별(한글)'] = np.where(df['성별'] == 'M', '남성', '여성')
print(df)

    이름  위치 성별    취미
0   토끼  독산  F  인공지능
1   핀다  종로  M  인공지능
2  코알라  하남  F  인공지능
(array([1]),)
['여성' '남성' '여성']

    이름  위치 성별    취미 성별(한글)
0   토끼  독산  F  인공지능     여성
1   핀다  종로  M  인공지능     남성
2  코알라  하남  F  인공지능     여성

In [33]:
df = pd.DataFrame({
    '이름': ['토끼', '핀다', '코알라'],
    '위치': ['독산', '종로', '하남'],
    '성별': ['F', 'M', 'F'],
    '키': [112, 123, 452],
    '체중': [13, 54, 67]
})
df

    이름  위치 성별    키  체중
0   토끼  독산  F  112  13
1   핀다  종로  M  123  54
2  코알라  하남  F  452  67

In [34]:
# 컬럼 추가3 기존컬럼연산 이용 -> Series 이용
# BMI = kg / m^2
df['BMI'] = df['체중'] / (df['키'] * 0.01 ** 2)
df

    이름  위치 성별    키  체중          BMI
0   토끼  독산  F  112  13  1160.714286
1   핀다  종로  M  123  54  4390.243902
2  코알라  하남  F  452  67  1482.300885

In [ ]:
# 컬럼 추가3 drop 이용
df.drop('BMI type', axis=1, inplace=True)

In [ ]:
# apply()
def get_type(value):
    return ' 저체중 if value <18 else "표준"

df["BMI"].apply(get_type)

In [36]:
file_path = "./data/bank_client_information.csv"
df = pd.read_csv(file_path)

In [37]:
df.sort_values('Net Worth', ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [40]:
# 오래된 고객순으로 출력
df.sort_values('Years with Bank', ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [ ]:
# 순자산이 많고 오래된 고객순
df.sort_values(['Net Worth', 'Years with Bank'], ascending=[False, False])

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [47]:
# rank()
df['Rank'] = df['Net Worth'].rank(ascending=False).astype(int)
df.sort_values('Rank')

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Rank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,1
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,2
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,4
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,5
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,6
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,7
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,8
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,8
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,10